This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
Author: Bruno Le Floch
============================================================
TEST 1: Assign a symbolic expression
============================================================
Defining \__fp_parse_word_A:N on line ...
Defining \__fp_parse_word_B:N on line ...
Defining \__fp_parse_word_C:N on line ...
> \l_tmpa_fp=((A)+(csc(B)))+((C)*(sin(B))).
<recently read> }
l. ...  }
> \l_tmpa_fp=((A)+(csc(B)))+((C)*(sin(B))).
<recently read> }
l. ...  }
((A)+(2))+((C)*(0.4999999999999999))
((A)+(2))+(0.5999999999999999)
3.6
============================================================
============================================================
TEST 2: Conversions
============================================================
! Use of \??? doesn't match its definition.
<argument> \???  
                 ! LaTeX Error: Invalid operation fp_to_decimal((A)+((B)^(2)))
l. ...  }
If you say, e.g., `\def\a1{...}', then you must always
put `1' after `\a', since control sequence names are
made up of letters only. The macro here has not been
followed by the required stuff, so I'm ignoring it.
! Use of \??? doesn't match its definition.
<argument> \???  
                 ! LaTeX Error: Invalid operation fp_to_dim((A)+((B)^(2)))
l. ...  }
If you say, e.g., `\def\a1{...}', then you must always
put `1' after `\a', since control sequence names are
made up of letters only. The macro here has not been
followed by the required stuff, so I'm ignoring it.
! Use of \??? doesn't match its definition.
<argument> \???  
                 ! LaTeX Error: Invalid operation fp_to_int((A)+((B)^(2)))
l. ...  }
If you say, e.g., `\def\a1{...}', then you must always
put `1' after `\a', since control sequence names are
made up of letters only. The macro here has not been
followed by the required stuff, so I'm ignoring it.
! Use of \??? doesn't match its definition.
<argument> \???  
                 ! LaTeX Error: Invalid operation fp_to_scientific((A)+((B)^...
l. ...  }
If you say, e.g., `\def\a1{...}', then you must always
put `1' after `\a', since control sequence names are
made up of letters only. The macro here has not been
followed by the required stuff, so I'm ignoring it.
0
0pt
0
nan
(A)+((B)^(2))
============================================================
============================================================
TEST 3: Unary minus and not
============================================================
-((A)+((B)^(2)))
!((A)+((B)^(2)))
============================================================
============================================================
TEST 4: Various variable names
============================================================
! LaTeX Error: Floating point identifier '' invalid.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to create a new floating point identifier '' but this may
only contain ASCII letters.
! LaTeX Error: Floating point identifier 'a b' invalid.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to create a new floating point identifier 'a b' but this
may only contain ASCII letters.
! LaTeX Error: Floating point identifier 'a12' invalid.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to create a new floating point identifier 'a12' but this
may only contain ASCII letters.
! LaTeX Error: Floating point identifier '\\' invalid.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to create a new floating point identifier '\\' but this
may only contain ASCII letters.
! LaTeX Error: Floating point identifier 'a_b' invalid.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to create a new floating point identifier 'a_b' but this
may only contain ASCII letters.
Defining \__fp_parse_word_chk:N on line ...
Defining \__fp_parse_word_aux:N on line ...
Defining \__fp_parse_word_tmpa:N on line ...
! LaTeX Error: Floating point identifier 'pi' already defined.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to create a new floating point identifier 'pi' but this
name has already been used elsewhere.
Defining \__fp_parse_word_pi:N on line ...
! LaTeX Error: Floating point identifier 'inf' already defined.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to create a new floating point identifier 'inf' but this
name has already been used elsewhere.
Defining \__fp_parse_word_inf:N on line ...
(((((1)/(inf))+(pi))+(tmpa))+(aux))+(chk)
============================================================
============================================================
TEST 5: Loops
============================================================
Defining \__fp_parse_word_X:N on line ...
Defining \__fp_parse_word_Y:N on line ...
! LaTeX Error: Variable 'X' used in the definition of 'X'.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to set the floating point identifier 'X' to the
expression 'sin(X)'. Evaluating this expression yields 'sin(X)', which
contains 'X' itself.
> X=nan.
<recently read> }
l. ...  }
> X=(Y)^(1).
<recently read> }
l. ...  }
! LaTeX Error: Variable 'Y' used in the definition of 'Y'.
For immediate help type H <return>.
 ...                                              
l. ...  }
LaTeX has been asked to set the floating point identifier 'Y' to the
expression 'X+1'. Evaluating this expression yields '((Y)^(1))+(1)', which
contains 'Y' itself.
> Y=nan.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 6: Set and clear both acts locally
============================================================
Defining \__fp_parse_word_P:N on line ...
((P)*(P))+(1)
401
((P)*(P))+(1)
401
((P)*(P))+(1)
401
((P)*(P))+(1)
============================================================
