This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
Author: Joseph Wright
============================================================
TEST 1: Naming colors by model
============================================================
Defining \l__color_named_foo1_tl on line ...
Defining \l__color_named_foo1_prop on line ...
The color foo1 has the properties:
>  model  =>  gray
>  gray  =>  0.1.
<recently read> }
l. ...  }
Defining \l__color_named_foo2_tl on line ...
Defining \l__color_named_foo2_prop on line ...
The color foo2 has the properties:
>  model  =>  rgb
>  rgb  =>  0.1 0.2 0.3.
<recently read> }
l. ...  }
Defining \l__color_named_foo3_tl on line ...
Defining \l__color_named_foo3_prop on line ...
The color foo3 has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.1 0.2 0.3 0.4.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 2: Renaming colors by model
============================================================
The color foo1 has the properties:
>  model  =>  gray
>  gray  =>  0.1.
<recently read> }
l. ...  }
The color foo1 has the properties:
>  model  =>  rgb
>  rgb  =>  0.1 0.2 0.3.
<recently read> }
l. ...  }
The color foo1 has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.1 0.2 0.3 0.4.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 3: Naming colors by expression
============================================================
The color foo1 has the properties:
>  model  =>  gray
>  gray  =>  0.0.
<recently read> }
l. ...  }
The color foo2 has the properties:
>  model  =>  gray
>  gray  =>  0.5.
<recently read> }
l. ...  }
The color foo3 has the properties:
>  model  =>  rgb
>  rgb  =>  1 0.5 0.5.
<recently read> }
l. ...  }
Defining \l__color_named_foo4_tl on line ...
Defining \l__color_named_foo4_prop on line ...
The color foo4 has the properties:
>  model  =>  rgb
>  rgb  =>  0.125 0.125 0.75.
<recently read> }
l. ...  }
Defining \l__color_named_foo5_tl on line ...
Defining \l__color_named_foo5_prop on line ...
The color foo5 has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.02 0.18 0.8 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 4: Naming colors by expression with model conversion
============================================================
The color foo1 has the properties:
>  model  =>  rgb
>  rgb  =>  0.5 0.5 0.5.
<recently read> }
l. ...  }
The color foo2 has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.5 0.5 0.5 0.
<recently read> }
l. ...  }
The color foo3 has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.05 0.05 0.05 0.9.
<recently read> }
l. ...  }
The color foo4 has the properties:
>  model  =>  rgb
>  rgb  =>  0.1 0 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 5: Mixing with the gray model
============================================================
Defining \l__color_named_mywhitemixA_tl on line ...
Defining \l__color_named_mywhitemixA_prop on line ...
The color mywhitemixA has the properties:
>  model  =>  rgb
>  rgb  =>  1 0.4 0.4.
<recently read> }
l. ...  }
Defining \l__color_named_mywhitemixB_tl on line ...
Defining \l__color_named_mywhitemixB_prop on line ...
The color mywhitemixB has the properties:
>  model  =>  rgb
>  rgb  =>  1 0.4 0.4.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 6: Copying named colors
============================================================
The color foo2 has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.25 0.75 0 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 7: Copying the current color
============================================================
Defining \l__color_named_foo_tl on line ...
Defining \l__color_named_foo_prop on line ...
The color foo has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.25 0.75 0 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 8: Selecting colors
============================================================
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {0.0 g 0.0 G}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {0.25 0.75 0 rg 0.25 0.75 0 RG}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {0.33 g 0.33 G}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {0.9 0.2 0.4 0.0 k 0.9 0.2 0.4 0.0 K}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
============================================================
============================================================
TEST 9: Fixing the model
============================================================
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {1 0.75 0.75 rg 1 0.75 0.75 RG}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {1 0.75 0.75 rg 1 0.75 0.75 RG}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {0 0.25 0.25 0 k 0 0.25 0.25 0 K}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\pdfcolorstack 0 push {0.825 g 0.825 G}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\pdfcolorstack 0 pop
! OK.
<argument> \l_tmpa_box 
l. ...  }
============================================================
============================================================
TEST 10: Showing colors
============================================================
The color unknown is undefined.
> .
<recently read> }
l. ...  }
The color black has the properties:
>  model  =>  gray
>  gray  =>  0.0.
<recently read> }
l. ...  }
The color red has the properties:
>  model  =>  rgb
>  rgb  =>  1.0 0.0 0.0.
<recently read> }
l. ...  }
The color cyan has the properties:
>  model  =>  cmyk
>  cmyk  =>  1.0 0.0 0.0 0.0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 11: Managing the current color
============================================================
The color . has the properties:
>  model  =>  cmyk
>  cmyk  =>  0.0 1.0 0.5 0.0.
<recently read> }
l. ...  }
The color . has the properties:
>  model  =>  rgb
>  rgb  =>  1.0 0.0 0.0.
<recently read> }
l. ...  }
============================================================
