This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
Author: Joseph Wright
============================================================
TEST 1: Naming colors by model
============================================================
Defining \l__color_named_foo1_tl on line ...
The color foo1 has the properties:
>  model  =>  gray
>  value  =>  0.1.
<recently read> }
l. ...  }
Defining \l__color_named_foo2_tl on line ...
The color foo2 has the properties:
>  model  =>  rgb
>  value  =>  0.1, 0.2, 0.3.
<recently read> }
l. ...  }
Defining \l__color_named_foo3_tl on line ...
The color foo3 has the properties:
>  model  =>  cmyk
>  value  =>  0.1, 0.2, 0.3, 0.4.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 2: Renaming colors by model
============================================================
The color foo1 has the properties:
>  model  =>  gray
>  value  =>  0.1.
<recently read> }
l. ...  }
The color foo1 has the properties:
>  model  =>  rgb
>  value  =>  0.1, 0.2, 0.3.
<recently read> }
l. ...  }
The color foo1 has the properties:
>  model  =>  cmyk
>  value  =>  0.1, 0.2, 0.3, 0.4.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 3: Naming colors by expression
============================================================
The color foo1 has the properties:
>  model  =>  gray
>  value  =>  0.0.
<recently read> }
l. ...  }
The color foo2 has the properties:
>  model  =>  gray
>  value  =>  0.5.
<recently read> }
l. ...  }
The color foo3 has the properties:
>  model  =>  rgb
>  value  =>  1, 0.5, 0.5.
<recently read> }
l. ...  }
Defining \l__color_named_foo4_tl on line ...
The color foo4 has the properties:
>  model  =>  rgb
>  value  =>  0.125, 0.125, 0.75.
<recently read> }
l. ...  }
Defining \l__color_named_foo5_tl on line ...
The color foo5 has the properties:
>  model  =>  cmyk
>  value  =>  0.02, 0.18, 0.8, 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 4: Naming colors by expression with model conversion
============================================================
The color foo1 has the properties:
>  model  =>  rgb
>  value  =>  0.5, 0.5, 0.5.
<recently read> }
l. ...  }
The color foo2 has the properties:
>  model  =>  cmyk
>  value  =>  0.5, 0.5, 0.5, 0.
<recently read> }
l. ...  }
The color foo3 has the properties:
>  model  =>  cmyk
>  value  =>  0.05, 0.05, 0.05, 0.9.
<recently read> }
l. ...  }
The color foo4 has the properties:
>  model  =>  rgb
>  value  =>  0.1, 0, 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 5: Copying named colors
============================================================
The color foo2 has the properties:
>  model  =>  cmyk
>  value  =>  0.25, 0.75, 0, 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 6: Copying the current color
============================================================
Defining \l__color_named_foo_tl on line ...
The color foo has the properties:
>  model  =>  cmyk
>  value  =>  0.25, 0.75, 0, 0.
<recently read> }
l. ...  }
============================================================
============================================================
TEST 7: Selecting colors
============================================================
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push gray 0}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push rgb 0.25 0.75 0}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push gray 0.33}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push cmyk 0.9 0.2 0.4 0}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
============================================================
============================================================
TEST 8: Fixing the model
============================================================
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push rgb 1 0.75 0.75}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push rgb 1 0.75 0.75}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push cmyk 0 0.25 0.25 0}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
> \box...=
\hbox(6.94444+0.0)x22.50005
.\special{color push gray 0.825}
.\OT1/cmr/m/n/10 H
.\OT1/cmr/m/n/10 e
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 l
.\OT1/cmr/m/n/10 o
.\special{color pop}
! OK.
<argument> \l_tmpa_box 
l. ...  }
============================================================
============================================================
TEST 9: Showing colors
============================================================
The color unknown is undefined.
> .
<recently read> }
l. ...  }
The color black has the properties:
>  model  =>  gray
>  value  =>  0.0.
<recently read> }
l. ...  }
The color red has the properties:
>  model  =>  rgb
>  value  =>  1.0, 0.0, 0.0.
<recently read> }
l. ...  }
The color cyan has the properties:
>  model  =>  cmyk
>  value  =>  1.0, 0.0, 0.0, 0.0.
<recently read> }
l. ...  }
============================================================
