This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
%% \CharacterTable
%%  {Upper-case    \A\B\C\D\E\F\G\H\I\J\K\L\M\N\O\P\Q\R\S\T\U\V\W\X\Y\Z
%%   Lower-case    \a\b\c\d\e\f\g\h\i\j\k\l\m\n\o\p\q\r\s\t\u\v\w\x\y\z
%%   Digits        \0\1\2\3\4\5\6\7\8\9
%%   Exclamation   \!     Double quote  \"     Hash (number) \#
%%   Dollar        \$     Percent       \%     Ampersand     \&
%%   Acute accent  \'     Left paren    \(     Right paren   \)
%%   Asterisk      \*     Plus          \+     Comma         \,
%%   Minus         \-     Point         \.     Solidus       \/
%%   Colon         \:     Semicolon     \;     Less than     \<
%%   Equals        \=     Greater than  \>     Question mark \?
%%   Commercial at \@     Left bracket  \[     Backslash     \\
%%   Right bracket \]     Circumflex    \^     Underscore    \_
%%   Grave accent  \`     Left brace    \{     Vertical bar  \|
%%   Right brace   \}     Tilde         \~}
%%
Author: LaTeX3 Project
============================================================
TEST 1: Creating new fps
============================================================
Defining \l_A_fp on line ...
!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
!
! LaTeX error: "kernel/command-already-defined"
! 
! Control sequence \l_A_fp already defined.
! 
! See the LaTeX3 documentation for further information.
! 
! For immediate help type H <return>.
!...............................................  
l.26   }
|'''''''''''''''''''''''''''''''''''''''''''''''
| This is a coding error.
| 
| LaTeX has been asked to create a new control sequence '\l_A_fp' but this
| name has already been used elsewhere.
| 
| The current meaning is:
|   macro:->\s_fp \fp_use:w 00\s_fp_exact ;
|...............................................
Defining \l_A_fp on line ...
Defining \l_B_fp on line ...
Defining \g_A_fp on line ...
Defining \g_B_fp on line ...
> 0.
<argument> {0}
l.26   }
> 0.
<argument> {0}
l.26   }
> 0.
<argument> {0}
l.26   }
============================================================
============================================================
TEST 2: Set fp
============================================================
> 123.456.
<argument> {123.456}
l.58   }
> -123.456.
<argument> {-123.456}
l.58   }
> 3.
<argument> {3}
l.58   }
> -0.
<argument> {-0}
l.58   }
! Undefined control sequence.
<argument> \LaTeX3 error: 
                           Premature end in fp expression.
l.58   }
The control sequence at the end of the top line
of your error message was never \def'ed. If you have
misspelled it (e.g., `\hobx'), type `I' and the correct
spelling (e.g., `I\hbox'). Otherwise just continue,
and I'll forget about whatever was undefined.
> 0.
<argument> {0}
l.58   }
> nan.
<argument> {nan}
l.58   }
! Undefined control sequence.
<argument> \LaTeX3 error: 
                           Premature end in fp expression.
l.58   }
The control sequence at the end of the top line
of your error message was never \def'ed. If you have
misspelled it (e.g., `\hobx'), type `I' and the correct
spelling (e.g., `I\hbox'). Otherwise just continue,
and I'll forget about whatever was undefined.
> -0.001.
<argument> {-0.001}
l.58   }
> nan.
<argument> {nan}
l.58   }
> 1.23456789e20.
<argument> {1.23456789e20}
l.58   }
> 1.23456789e-15.
<argument> {1.23456789e-15}
l.58   }
> 0.
<argument> {0}
l.58   }
> 0.
<argument> {0}
l.58   }
> 3.
<argument> {3}
l.58   }
> -0.
<argument> {-0}
l.58   }
============================================================
============================================================
TEST 3: Set fp from dimen
============================================================
> 1.
<argument> {1}
l.78   }
> 16383.99998474121.
<argument> {16383.99998474121}
l.78   }
> 1.52587890625e-5.
<argument> {1.52587890625e-5}
l.78   }
> 2845.275588989258.
<argument> {2845.275588989258}
l.78   }
> 0.
<argument> {0}
l.78   }
> 0.
<argument> {0}
l.78   }
> 1.52587890625e-5.
<argument> {1.52587890625e-5}
l.78   }
> 2845.275588989258.
<argument> {2845.275588989258}
l.78   }
============================================================
============================================================
TEST 4: Zero fp
============================================================
> 1.234.
<argument> {1.234}
l.96   }
> 1.234.
<argument> {1.234}
l.96   }
> 0.
<argument> {0}
l.96   }
> 0.
<argument> {0}
l.96   }
> 1.234.
<argument> {1.234}
l.96   }
> 0.
<argument> {0}
l.96   }
============================================================
============================================================
TEST 5: Set fps equal
============================================================
> 0.
<argument> {0}
l.116   }
> 0.
<argument> {0}
l.116   }
> 123.456.
<argument> {123.456}
l.116   }
> 123.456.
<argument> {123.456}
l.116   }
> 0.
<argument> {0}
l.116   }
> 123.456.
<argument> {123.456}
l.116   }
============================================================
============================================================
TEST 6: Use fps
============================================================
1.234
12340000000000
0.01234
0.0000000000001234
============================================================
============================================================
TEST 7: Convert fp to int
============================================================
57
56
0
1
============================================================
============================================================
TEST 8: Convert fp to tl
============================================================
56.7
-1230000000
1e-5
0.997
============================================================
============================================================
TEST 9: Round to places
============================================================
> 1.23456789.
<argument> {1.23456789}
l.200   }
> 1.23456789.
<argument> {1.23456789}
l.200   }
> 1.23457.
<argument> {1.23457}
l.200   }
> 1.23.
<argument> {1.23}
l.200   }
> 1.
<argument> {1}
l.200   }
> 0.
<argument> {0}
l.200   }
> 0.01235.
<argument> {0.01235}
l.200   }
> 123.45679.
<argument> {123.45679}
l.200   }
> 1.23456789.
<argument> {1.23456789}
l.200   }
> 56.7.
<argument> {56.7}
l.200   }
> 1.23456789.
<argument> {1.23456789}
l.200   }
============================================================
============================================================
TEST 10: Round to figures
============================================================
> 1.23456789.
<argument> {1.23456789}
l.235   }
> 1.23456789.
<argument> {1.23456789}
l.235   }
> 1.2346.
<argument> {1.2346}
l.235   }
> 1.2.
<argument> {1.2}
l.235   }
> 0.
<argument> {0}
l.235   }
> 0.
<argument> {0}
l.235   }
> 0.012346.
<argument> {0.012346}
l.235   }
> 123.46.
<argument> {123.46}
l.235   }
> 1.23456789.
<argument> {1.23456789}
l.235   }
> 56.7.
<argument> {56.7}
l.235   }
> 1.23456789.
<argument> {1.23456789}
l.235   }
============================================================
============================================================
TEST 11: Test if fp undefined (expect F/F/F/T)
============================================================
FALSE
FALSE
FALSE
TRUE
============================================================
============================================================
TEST 12: Test if fp zero (expect F/T/F/F)
============================================================
FALSE
TRUE
FALSE
FALSE
============================================================
============================================================
TEST 13: Convert to absolute values
============================================================
> 111.111.
<argument> {111.111}
l.292   }
> 222.222.
<argument> {222.222}
l.292   }
> 333.333.
<argument> {333.333}
l.292   }
> 444.444.
<argument> {444.444}
l.292   }
> 111.111.
<argument> {111.111}
l.292   }
> 222.222.
<argument> {222.222}
l.292   }
> 333.333.
<argument> {333.333}
l.292   }
> 444.444.
<argument> {444.444}
l.292   }
> -111.111.
<argument> {-111.111}
l.292   }
> 222.222.
<argument> {222.222}
l.292   }
> 333.333.
<argument> {333.333}
l.292   }
> 444.444.
<argument> {444.444}
l.292   }
============================================================
============================================================
TEST 14: Convert to negative values
============================================================
> 111.111.
<argument> {111.111}
l.328   }
> -222.222.
<argument> {-222.222}
l.328   }
> 333.333.
<argument> {333.333}
l.328   }
> -444.444.
<argument> {-444.444}
l.328   }
> -111.111.
<argument> {-111.111}
l.328   }
> 222.222.
<argument> {222.222}
l.328   }
> -333.333.
<argument> {-333.333}
l.328   }
> 444.444.
<argument> {444.444}
l.328   }
> -111.111.
<argument> {-111.111}
l.328   }
> 222.222.
<argument> {222.222}
l.328   }
> 333.333.
<argument> {333.333}
l.328   }
> -444.444.
<argument> {-444.444}
l.328   }
============================================================
============================================================
TEST 15: Addition
============================================================
> 1.
<argument> {1}
l.370   }
> 101.
<argument> {101}
l.370   }
> 101.99.
<argument> {101.99}
l.370   }
> 102.
<argument> {102}
l.370   }
> -2898.123.
<argument> {-2898.123}
l.370   }
> 7101.877.
<argument> {7101.877}
l.370   }
> 99.123456.
<argument> {99.123456}
l.370   }
> -39900.876544.
<argument> {-39900.876544}
l.370   }
> 99.123456.
<argument> {99.123456}
l.370   }
> 1000000000.
<argument> {1000000000}
l.370   }
> 2000000000.
<argument> {2000000000}
l.370   }
> -1.234.
<argument> {-1.234}
l.370   }
> 0.
<argument> {0}
l.370   }
> 10000.
<argument> {10000}
l.370   }
> -0.001.
<argument> {-0.001}
l.370   }
> -1.
<argument> {-1}
l.370   }
> 123.456.
<argument> {123.456}
l.370   }
> -1.
<argument> {-1}
l.370   }
============================================================
============================================================
TEST 16: Subtraction
============================================================
> 1.
<argument> {1}
l.412   }
> -99.
<argument> {-99}
l.412   }
> -99.99.
<argument> {-99.99}
l.412   }
> -100.
<argument> {-100}
l.412   }
> -100.0004.
<argument> {-100.0004}
l.412   }
> 2900.1226.
<argument> {2900.1226}
l.412   }
> -7099.8774.
<argument> {-7099.8774}
l.412   }
> 99.123456.
<argument> {99.123456}
l.412   }
> 40099.123456.
<argument> {40099.123456}
l.412   }
> -1000000000.
<argument> {-1000000000}
l.412   }
> -2000000000.
<argument> {-2000000000}
l.412   }
> -2000000000.
<argument> {-2000000000}
l.412   }
> -1.234.
<argument> {-1.234}
l.412   }
> 0.
<argument> {0}
l.412   }
> -0.001.
<argument> {-0.001}
l.412   }
> -1.
<argument> {-1}
l.412   }
> 123.456.
<argument> {123.456}
l.412   }
> -1.
<argument> {-1}
l.412   }
============================================================
============================================================
TEST 17: Multiplication
============================================================
> -0.
<argument> {-0}
l.446   }
> -0.
<argument> {-0}
l.446   }
> 9.99999998e17.
<argument> {9.99999998e17}
l.446   }
> 700.6652.
<argument> {700.6652}
l.446   }
> -7.006652.
<argument> {-7.006652}
l.446   }
> -7.006652.
<argument> {-7.006652}
l.446   }
> 7.006652.
<argument> {7.006652}
l.446   }
> 7.006652.
<argument> {7.006652}
l.446   }
> 123.456.
<argument> {123.456}
l.446   }
> 7.006652.
<argument> {7.006652}
l.446   }
============================================================
============================================================
TEST 18: Division
============================================================
> inf.
<argument> {inf}
l.489   }
> 0.
<argument> {0}
l.489   }
! Undefined control sequence.
<argument> \LaTeX3 error: 
                           \fp_info: +0/+0; 
l.489   }
The control sequence at the end of the top line
of your error message was never \def'ed. If you have
misspelled it (e.g., `\hobx'), type `I' and the correct
spelling (e.g., `I\hbox'). Otherwise just continue,
and I'll forget about whatever was undefined.
> nan.
<argument> {nan}
l.489   }
> 0.2173300457907714.
<argument> {0.2173300457907714}
l.489   }
> -0.2173300457907714.
<argument> {-0.2173300457907714}
l.489   }
> -0.2173300457907714.
<argument> {-0.2173300457907714}
l.489   }
> 0.2173300457907714.
<argument> {0.2173300457907714}
l.489   }
> 1111111.111111111.
<argument> {1111111.111111111}
l.489   }
> -1e-13.
<argument> {-1e-13}
l.489   }
> 10000000000.
<argument> {10000000000}
l.489   }
> -1.01010101010101e-4.
<argument> {-1.01010101010101e-4}
l.489   }
> 123.456.
<argument> {123.456}
l.489   }
> -1.01010101010101e-4.
<argument> {-1.01010101010101e-4}
l.489   }
============================================================
============================================================
TEST 19: Powers
============================================================
> 0.
<argument> {0}
l.538   }
> inf.
<argument> {inf}
l.538   }
> 1.
<argument> {1}
l.538   }
> 1.
<argument> {1}
l.538   }
> 4.
<argument> {4}
l.538   }
> 1.414213562373095.
<argument> {1.414213562373095}
l.538   }
> 0.125.
<argument> {0.125}
l.538   }
> 681472.
<argument> {681472}
l.538   }
> 11803.06482086442.
<argument> {11803.06482086442}
l.538   }
! Undefined control sequence.
<argument> \LaTeX3 error: 
                           Invalid operation (-5.5)^(5.5)
l.538   }
The control sequence at the end of the top line
of your error message was never \def'ed. If you have
misspelled it (e.g., `\hobx'), type `I' and the correct
spelling (e.g., `I\hbox'). Otherwise just continue,
and I'll forget about whatever was undefined.
> nan.
<argument> {nan}
l.538   }
> -5032.84375.
<argument> {-5032.84375}
l.538   }
> 915.0625.
<argument> {915.0625}
l.538   }
> 2.25.
<argument> {2.25}
l.538   }
> 123.456.
<argument> {123.456}
l.538   }
> 2.25.
<argument> {2.25}
l.538   }
============================================================
============================================================
TEST 20: Exponential
============================================================
Defining \c_fp_exp(0)_fp on line ...
> 1.
<argument> {1}
l.570   }
Defining \c_fp_exp(0{2}{1500}{0000}{0000}{0000})_fp on line ...
> 3269017.372472111.
<argument> {3269017.372472111}
l.570   }
Defining \c_fp_exp(0{3}{1245}{6700}{0000}{0000})_fp on line ...
> 1.255338149748617e54.
<argument> {1.255338149748617e54}
l.570   }
Defining \c_fp_exp(2{2}{1500}{0000}{0000}{0000})_fp on line ...
> 3.059023205018258e-7.
<argument> {3.059023205018258e-7}
l.570   }
Defining \c_fp_exp(2{3}{1245}{6700}{0000}{0000})_fp on line ...
> 7.965981119909811e-55.
<argument> {7.965981119909811e-55}
l.570   }
Defining \c_fp_exp(0{-1}{2000}{0000}{0000}{0000})_fp on line ...
> 1.020201340026756.
<argument> {1.020201340026756}
l.570   }
Defining \c_fp_exp(0{-5}{1000}{0000}{0000}{0000})_fp on line ...
> 1.0000010000005.
<argument> {1.0000010000005}
l.570   }
Defining \c_fp_exp(0{-39}{1000}{0000}{0000}{0000})_fp on line ...
> 1.
<argument> {1}
l.570   }
Defining \c_fp_exp(0{3}{4000}{0000}{0000}{0000})_fp on line ...
> 5.221469689764144e173.
<argument> {5.221469689764144e173}
l.570   }
Defining \c_fp_exp(2{3}{4000}{0000}{0000}{0000})_fp on line ...
> 1.915169596714006e-174.
<argument> {1.915169596714006e-174}
l.570   }
Defining \c_fp_exp(0{1}{1500}{0000}{0000}{0000})_fp on line ...
> 4.481689070338065.
<argument> {4.481689070338065}
l.570   }
> 123.456.
<argument> {123.456}
l.570   }
> 4.481689070338065.
<argument> {4.481689070338065}
l.570   }
============================================================
============================================================
TEST 21: Logarithm
============================================================
Defining \c_fp_ln(0)_fp on line ...
> -inf.
<argument> {-inf}
l.608   }
Defining \c_fp_ln(2{1}{2000}{0000}{0000}{0000})_fp on line ...
! Undefined control sequence.
<argument> \LaTeX3 error: 
                           Invalid operation ln(-2)
l.608   }
The control sequence at the end of the top line
of your error message was never \def'ed. If you have
misspelled it (e.g., `\hobx'), type `I' and the correct
spelling (e.g., `I\hbox'). Otherwise just continue,
and I'll forget about whatever was undefined.
> nan.
<argument> {nan}
l.608   }
Defining \c_fp_ln(0{1}{1000}{0000}{0000}{0000})_fp on line ...
> 0.
<argument> {0}
l.608   }
Defining \c_fp_ln(0{1}{2000}{0000}{0000}{0000})_fp on line ...
> 0.6931471805599453.
<argument> {0.6931471805599453}
l.608   }
Defining \c_fp_ln(0{1}{8000}{0000}{0000}{0000})_fp on line ...
> 2.079441541679836.
<argument> {2.079441541679836}
l.608   }
Defining \c_fp_ln(0{2}{1000}{0000}{0000}{0000})_fp on line ...
> 2.302585092994046.
<argument> {2.302585092994046}
l.608   }
Defining \c_fp_ln(0{2}{4000}{0000}{0000}{0000})_fp on line ...
> 3.688879454113936.
<argument> {3.688879454113936}
l.608   }
Defining \c_fp_ln(0{41}{1000}{0000}{0000}{0000})_fp on line ...
> 92.10340371976183.
<argument> {92.10340371976183}
l.608   }
Defining \c_fp_ln(0{1}{1234}{5000}{0000}{0000})_fp on line ...
> 0.2106660298030971.
<argument> {0.2106660298030971}
l.608   }
Defining \c_fp_ln(0{3}{3425}{6700}{0000}{0000})_fp on line ...
> 5.836467259009053.
<argument> {5.836467259009053}
l.608   }
Defining \c_fp_ln(0{0}{1000}{0000}{0000}{0000})_fp on line ...
> -2.302585092994046.
<argument> {-2.302585092994046}
l.608   }
Defining \c_fp_ln(0{-1}{2000}{0000}{0000}{0000})_fp on line ...
> -3.912023005428146.
<argument> {-3.912023005428146}
l.608   }
Defining \c_fp_ln(0{-1}{3000}{0000}{0000}{0000})_fp on line ...
> -3.506557897319982.
<argument> {-3.506557897319982}
l.608   }
Defining \c_fp_ln(0{-39}{1000}{0000}{0000}{0000})_fp on line ...
> -92.10340371976183.
<argument> {-92.10340371976183}
l.608   }
Defining \c_fp_ln(0{1}{1500}{0000}{0000}{0000})_fp on line ...
> 0.4054651081081644.
<argument> {0.4054651081081644}
l.608   }
> 123.456.
<argument> {123.456}
l.608   }
> 0.4054651081081644.
<argument> {0.4054651081081644}
l.608   }
============================================================
============================================================
TEST 22: Sine
============================================================
Defining \c_fp_sin(0)_fp on line ...
> 0.
<argument> {0}
l.666   }
Defining \c_fp_sin(0{0}{1000}{0000}{0000}{0000})_fp on line ...
> 0.09983341664682815.
<argument> {0.09983341664682815}
l.666   }
Defining \c_fp_sin(0{0}{8000}{0000}{0000}{0000})_fp on line ...
> 0.7173560908995228.
<argument> {0.7173560908995228}
l.666   }
Defining \c_fp_sin(0{-14}{1000}{0000}{0000}{0000})_fp on line ...
> 1e-15.
<argument> {1e-15}
l.666   }
Defining \c_fp_sin(2{0}{1000}{0000}{0000}{0000})_fp on line ...
> -0.09983341664682815.
<argument> {-0.09983341664682815}
l.666   }
Defining \c_fp_sin(2{0}{8000}{0000}{0000}{0000})_fp on line ...
> -0.7173560908995228.
<argument> {-0.7173560908995228}
l.666   }
Defining \c_fp_sin(0{1}{2100}{0000}{0000}{0000})_fp on line ...
> 0.863209366648874.
<argument> {0.863209366648874}
l.666   }
Defining \c_fp_sin(0{1}{2800}{0000}{0000}{0000})_fp on line ...
> 0.3349881501559056.
<argument> {0.3349881501559056}
l.666   }
Defining \c_fp_sin(2{1}{2100}{0000}{0000}{0000})_fp on line ...
> -0.863209366648874.
<argument> {-0.863209366648874}
l.666   }
Defining \c_fp_sin(2{1}{2800}{0000}{0000}{0000})_fp on line ...
> -0.3349881501559056.
<argument> {-0.3349881501559056}
l.666   }
Defining \c_fp_sin(0{1}{3141}{5926}{5358}{9794})_fp on line ...
> -0.
<argument> {-0}
l.666   }
Defining \c_fp_sin(2{1}{3141}{5926}{5358}{9794})_fp on line ...
> 0.
<argument> {0}
l.666   }
Defining \c_fp_sin(0{12}{1000}{0000}{0000}{0000})_fp on line ...
> 0.9286846706926827.
<argument> {0.9286846706926827}
l.666   }
Defining \c_fp_sin(0{0}{5000}{0000}{0000}{0000})_fp on line ...
> 0.479425538604203.
<argument> {0.479425538604203}
l.666   }
Defining \c_fp_sin(0{1}{2070}{7963}{2700}{0000})_fp on line ...
> 0.8775825617920411.
<argument> {0.8775825617920411}
l.666   }
Defining \c_fp_sin(0{1}{3641}{5926}{5400}{0000})_fp on line ...
> -0.4794255389641926.
<argument> {-0.4794255389641926}
l.666   }
Defining \c_fp_sin(0{1}{5212}{3889}{8000}{0000})_fp on line ...
> -0.8775825620748034.
<argument> {-0.8775825620748034}
l.666   }
Defining \c_fp_sin(0{1}{6783}{1853}{0700}{0000})_fp on line ...
> 0.4794255384465997.
<argument> {0.4794255384465997}
l.666   }
Defining \c_fp_sin(2{0}{5000}{0000}{0000}{0000})_fp on line ...
> -0.479425538604203.
<argument> {-0.479425538604203}
l.666   }
Defining \c_fp_sin(2{1}{2070}{7963}{2700}{0000})_fp on line ...
> -0.8775825617920411.
<argument> {-0.8775825617920411}
l.666   }
Defining \c_fp_sin(2{1}{3641}{5926}{5400}{0000})_fp on line ...
> 0.4794255389641926.
<argument> {0.4794255389641926}
l.666   }
Defining \c_fp_sin(2{1}{5212}{3889}{8000}{0000})_fp on line ...
> 0.8775825620748034.
<argument> {0.8775825620748034}
l.666   }
Defining \c_fp_sin(2{1}{6783}{1853}{0700}{0000})_fp on line ...
> -0.4794255384465997.
<argument> {-0.4794255384465997}
l.666   }
Defining \c_fp_sin(0{1}{1500}{0000}{0000}{0000})_fp on line ...
> 0.9974949866040544.
<argument> {0.9974949866040544}
l.666   }
> 123.456.
<argument> {123.456}
l.666   }
> 0.9974949866040544.
<argument> {0.9974949866040544}
l.666   }
============================================================
============================================================
TEST 23: Cosine
============================================================
Defining \c_fp_cos(0)_fp on line ...
> 1.
<argument> {1}
l.722   }
Defining \c_fp_cos(0{0}{1000}{0000}{0000}{0000})_fp on line ...
> 0.9950041652780258.
<argument> {0.9950041652780258}
l.722   }
Defining \c_fp_cos(0{0}{8000}{0000}{0000}{0000})_fp on line ...
> 0.6967067093471654.
<argument> {0.6967067093471654}
l.722   }
Defining \c_fp_cos(0{-14}{1000}{0000}{0000}{0000})_fp on line ...
> 1.
<argument> {1}
l.722   }
Defining \c_fp_cos(2{0}{1000}{0000}{0000}{0000})_fp on line ...
> 0.9950041652780258.
<argument> {0.9950041652780258}
l.722   }
Defining \c_fp_cos(2{0}{8000}{0000}{0000}{0000})_fp on line ...
> 0.6967067093471654.
<argument> {0.6967067093471654}
l.722   }
Defining \c_fp_cos(0{1}{2100}{0000}{0000}{0000})_fp on line ...
> -0.5048461045998571.
<argument> {-0.5048461045998571}
l.722   }
Defining \c_fp_cos(0{1}{2800}{0000}{0000}{0000})_fp on line ...
> -0.9422223406686579.
<argument> {-0.9422223406686579}
l.722   }
Defining \c_fp_cos(2{1}{2100}{0000}{0000}{0000})_fp on line ...
> -0.5048461045998571.
<argument> {-0.5048461045998571}
l.722   }
Defining \c_fp_cos(2{1}{2800}{0000}{0000}{0000})_fp on line ...
> -0.9422223406686579.
<argument> {-0.9422223406686579}
l.722   }
Defining \c_fp_cos(0{1}{3141}{5926}{5358}{9794})_fp on line ...
> -1.
<argument> {-1}
l.722   }
Defining \c_fp_cos(2{1}{3141}{5926}{5358}{9794})_fp on line ...
> -1.
<argument> {-1}
l.722   }
Defining \c_fp_cos(0{12}{1000}{0000}{0000}{0000})_fp on line ...
> 0.3708703040422938.
<argument> {0.3708703040422938}
l.722   }
Defining \c_fp_cos(0{0}{5000}{0000}{0000}{0000})_fp on line ...
> 0.8775825618903727.
<argument> {0.8775825618903727}
l.722   }
Defining \c_fp_cos(0{1}{2070}{7963}{2700}{0000})_fp on line ...
> -0.4794255387841978.
<argument> {-0.4794255387841978}
l.722   }
Defining \c_fp_cos(0{1}{3641}{5926}{5400}{0000})_fp on line ...
> -0.8775825616937095.
<argument> {-0.8775825616937095}
l.722   }
Defining \c_fp_cos(0{1}{5212}{3889}{8000}{0000})_fp on line ...
> 0.4794255382666049.
<argument> {0.4794255382666049}
l.722   }
Defining \c_fp_cos(0{1}{6783}{1853}{0700}{0000})_fp on line ...
> 0.8775825619764718.
<argument> {0.8775825619764718}
l.722   }
Defining \c_fp_cos(2{0}{5000}{0000}{0000}{0000})_fp on line ...
> 0.8775825618903727.
<argument> {0.8775825618903727}
l.722   }
Defining \c_fp_cos(2{1}{2070}{7963}{2700}{0000})_fp on line ...
> -0.4794255387841978.
<argument> {-0.4794255387841978}
l.722   }
Defining \c_fp_cos(2{1}{3641}{5926}{5400}{0000})_fp on line ...
> -0.8775825616937095.
<argument> {-0.8775825616937095}
l.722   }
Defining \c_fp_cos(2{1}{5212}{3889}{8000}{0000})_fp on line ...
> 0.4794255382666049.
<argument> {0.4794255382666049}
l.722   }
Defining \c_fp_cos(2{1}{6783}{1853}{0700}{0000})_fp on line ...
> 0.8775825619764718.
<argument> {0.8775825619764718}
l.722   }
Defining \c_fp_cos(0{1}{1500}{0000}{0000}{0000})_fp on line ...
> 0.07073720166770329.
<argument> {0.07073720166770329}
l.722   }
> 123.456.
<argument> {123.456}
l.722   }
> 0.07073720166770329.
<argument> {0.07073720166770329}
l.722   }
============================================================
============================================================
TEST 24: Tangent
============================================================
Defining \c_fp_tan(0)_fp on line ...
> 0.
<argument> {0}
l.784   }
Defining \c_fp_tan(0{0}{1000}{0000}{0000}{0000})_fp on line ...
> 0.1003346720854505.
<argument> {0.1003346720854505}
l.784   }
Defining \c_fp_tan(0{0}{8000}{0000}{0000}{0000})_fp on line ...
> 1.029638557050364.
<argument> {1.029638557050364}
l.784   }
Defining \c_fp_tan(0{1}{1800}{0000}{0000}{0000})_fp on line ...
> -4.286261674628071.
<argument> {-4.286261674628071}
l.784   }
Defining \c_fp_tan(0{-14}{1000}{0000}{0000}{0000})_fp on line ...
> 1e-15.
<argument> {1e-15}
l.784   }
Defining \c_fp_tan(2{0}{1000}{0000}{0000}{0000})_fp on line ...
> -0.1003346720854505.
<argument> {-0.1003346720854505}
l.784   }
Defining \c_fp_tan(2{0}{8000}{0000}{0000}{0000})_fp on line ...
> -1.029638557050364.
<argument> {-1.029638557050364}
l.784   }
Defining \c_fp_tan(2{1}{1800}{0000}{0000}{0000})_fp on line ...
> 4.286261674628071.
<argument> {4.286261674628071}
l.784   }
Defining \c_fp_tan(0{1}{2100}{0000}{0000}{0000})_fp on line ...
> -1.709846542904509.
<argument> {-1.709846542904509}
l.784   }
Defining \c_fp_tan(0{1}{2800}{0000}{0000}{0000})_fp on line ...
> -0.3555298316511767.
<argument> {-0.3555298316511767}
l.784   }
Defining \c_fp_tan(2{1}{2100}{0000}{0000}{0000})_fp on line ...
> 1.709846542904509.
<argument> {1.709846542904509}
l.784   }
Defining \c_fp_tan(2{1}{2800}{0000}{0000}{0000})_fp on line ...
> 0.3555298316511767.
<argument> {0.3555298316511767}
l.784   }
Defining \c_fp_tan(0{1}{3141}{5926}{5358}{9794})_fp on line ...
> 0.
<argument> {0}
l.784   }
Defining \c_fp_tan(0{12}{1000}{0000}{0000}{0000})_fp on line ...
> 2.504068566748272.
<argument> {2.504068566748272}
l.784   }
Defining \c_fp_tan(0{1}{1570}{7963}{2679}{4897})_fp on line ...
> -inf.
<argument> {-inf}
l.784   }
Defining \c_fp_tan(0{0}{5000}{0000}{0000}{0000})_fp on line ...
> 0.5463024898437905.
<argument> {0.5463024898437905}
l.784   }
Defining \c_fp_tan(0{1}{2070}{7963}{2700}{0000})_fp on line ...
> -1.830487720820113.
<argument> {-1.830487720820113}
l.784   }
Defining \c_fp_tan(0{1}{3641}{5926}{5400}{0000})_fp on line ...
> 0.546302490376421.
<argument> {0.546302490376421}
l.784   }
Defining \c_fp_tan(0{1}{5212}{3889}{8000}{0000})_fp on line ...
> -1.830487723386121.
<argument> {-1.830487723386121}
l.784   }
Defining \c_fp_tan(0{1}{6783}{1853}{0700}{0000})_fp on line ...
> 0.5463024896106051.
<argument> {0.5463024896106051}
l.784   }
Defining \c_fp_tan(2{0}{5000}{0000}{0000}{0000})_fp on line ...
> -0.5463024898437905.
<argument> {-0.5463024898437905}
l.784   }
Defining \c_fp_tan(2{1}{2070}{7963}{2700}{0000})_fp on line ...
> 1.830487720820113.
<argument> {1.830487720820113}
l.784   }
Defining \c_fp_tan(2{1}{3641}{5926}{5400}{0000})_fp on line ...
> -0.546302490376421.
<argument> {-0.546302490376421}
l.784   }
Defining \c_fp_tan(2{1}{5212}{3889}{8000}{0000})_fp on line ...
> 1.830487723386121.
<argument> {1.830487723386121}
l.784   }
Defining \c_fp_tan(2{1}{6783}{1853}{0700}{0000})_fp on line ...
> -0.5463024896106051.
<argument> {-0.5463024896106051}
l.784   }
Defining \c_fp_tan(0{1}{1500}{0000}{0000}{0000})_fp on line ...
> 14.10141994717164.
<argument> {14.10141994717164}
l.784   }
> 123.456.
<argument> {123.456}
l.784   }
> 14.10141994717164.
<argument> {14.10141994717164}
l.784   }
============================================================
============================================================
TEST 25: Comparisons: native (expect T/F/F/F/F/T/F/T/F/F/T/F/F/F/T/)
============================================================
TRUE
FALSE
FALSE
FALSE
FALSE
TRUE
FALSE
TRUE
FALSE
FALSE
TRUE
FALSE
FALSE
FALSE
TRUE
============================================================
